{
  "skills": {
    "frontend": ["HTML", "CSS", "TailwindCSS", "Bootstrap", "JavaScript", "TypeScript", "React", "Blazor", "Razor Pages"],
    "backend": ["Node.js", "Supabase", "Firebase", "SQL", "C#", "ASP.NET Core"]
  },
  "projects": [
    [
      {
        "name": "Crepz",
        "brief": "eCommerce Shoe Website",
        "description": "Crepz is an eCommerce shoe website, built with React TypeScript, Tailwind CSS, and Supabase. It offers a vast collection of trendy shoes from top brands. The user-friendly interface allows seamless navigation and browsing. With a personalized wishlist and basket, users can easily track their favorite products and complete checkouts.",
        "tech": ["TailwindCSS", "React", "TypeScript", "Supabase"],
        "Github": "https://github.com/Kroplewski-M/Crepz",
        "Website": "https://crepz.vercel.app/",
        "images": ["Crepz01", "Crepz02", "Crepz03", "Crepz04", "Crepz05", "Crepz06", "Crepz07"],
        "video": "CrepzPreview"
      }
    ],
    [
      {
        "name": "Talkrr",
        "brief": "Messaging web app",
        "description": "Talkrr is a Real-Time Messaging App. Its a cutting-edge communication platform that seamlessly connects users through instant messaging, user registration, and advanced user search capabilities. Built using React with TypeScript for a robust and intuitive front-end, and powered by Firebase for the backend, this app provides a secure, efficient, and enjoyable messaging experience.",
        "tech": ["React", "TypeScript", "Tailwind CSS", "Firebase"],
        "Github": "https://github.com/Kroplewski-M/Talkrr",
        "Website": "https://talkrr-mu.vercel.app/",
        "images": ["Talkrr01", "Talkrr02", "Talkrr03", "Talkrr04", "Talkrr05"],
        "video": "TalkrrPreview"
      }
    ],
    [
      {
        "name": "DesignABear",
        "brief": "eCommerce Teddy Bear Website",
        "description": "Design A Bear is an eCommerce website that allows users to create and customize their own teddy bears. The website is built using Blazor, Bootstrap, and Entity Framework. Users can choose from a variety of bear designs, and clothing to create their unique bear. The website also features a shopping cart.",
        "tech": ["Blazor", "Bootstrap", "Entity Framework", "SQL Server", "C#"],
        "Github": "https://github.com/Kroplewski-M/Blazor_Design_A_Bear",
        "Website": "",
        "images": [""],
        "video": ""
      }
    ],
    [
      {
        "name": "ProjectFlow",
        "brief": "Project Management Web Application",
        "description": "Project Flow is a project management web application that allows users to create, manage, and track projects. The application is built using ASP.NET MVC, Bootstrap, Entity Framework, and SQL Server. Users can create projects, assign tasks, and track progress. The application also features a user-friendly interface and a dashboard for easy navigation.",
        "tech": ["ASP.NET MVC", "Bootstrap", "Entity Framework", "SQL Server", "C#"],
        "Github": "https://github.com/Kroplewski-M/ProjectFlow",
        "Website": "",
        "images": [""],
        "video": ""
      }
    ],
    [
      {
        "name": "EnigmaMachine",
        "brief": "Enigma Machine Simulation Web Application",
        "description": "Enigma Machine is a web application that simulates the Enigma machine used during World War II to encrypt and decrypt messages. The application is built using Blazor and Bootstrap. Users can input messages, set the machine's settings, and encrypt or decrypt messages.",
        "tech": ["Blazor", "Bootstrap", "C#"],
        "Github": "https://github.com/Kroplewski-M/BlazorEnigma",
        "Website": "https://blazorenigmaweb.azurewebsites.net/",
        "images": [""],
        "video": ""
      }
    ],
    [
      {
        "name": "MangoMayhem",
        "brief": "Quiz Web Application",
        "description": "Mango Mayhem is a quiz web application that tests users' knowledge. The application is built using React with TypeScript and Tailwind CSS. Users can answer multiple-choice questions about many topics and receive a score at the end. The application also features a user-friendly interface and a leaderboard to track high scores. Users can also create their own quizzes and share them with friends.",
        "tech": ["React", "TypeScript", "Tailwind CSS", "Firebase"],
        "Github": "https://github.com/Kroplewski-M/MangoMahem",
        "Website": "https://mango-mayhem.vercel.app/",
        "images": [""],
        "video": ""
      }
    ]
  ]
}
